src/main/java/ok/dht/test/slastin/report/wrk2/puts-10000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.077ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms    1.55ms  35.07ms   98.05%
    Req/Sec    10.56k     1.24k   28.60k    78.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88ms
 75.000%    1.36ms
 90.000%    1.96ms
 99.000%    4.95ms
 99.900%   26.50ms
 99.990%   34.65ms
 99.999%   35.10ms
100.000%   35.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000            4         1.00
       0.222     0.100000        35137         1.11
       0.391     0.200000        70089         1.25
       0.558     0.300000       105172         1.43
       0.722     0.400000       140051         1.67
       0.882     0.500000       174999         2.00
       0.959     0.550000       192577         2.22
       1.030     0.600000       210188         2.50
       1.088     0.650000       227697         2.86
       1.189     0.700000       244981         3.33
       1.363     0.750000       262478         4.00
       1.457     0.775000       271239         4.44
       1.553     0.800000       280031         5.00
       1.651     0.825000       288727         5.71
       1.752     0.850000       297463         6.67
       1.854     0.875000       306217         8.00
       1.906     0.887500       310609         8.89
       1.957     0.900000       315043        10.00
       2.003     0.912500       319417        11.43
       2.047     0.925000       323813        13.33
       2.091     0.937500       328162        16.00
       2.119     0.943750       330345        17.78
       2.155     0.950000       332458        20.00
       2.205     0.956250       334689        22.86
       2.267     0.962500       336886        26.67
       2.337     0.968750       339023        32.00
       2.379     0.971875       340137        35.56
       2.433     0.975000       341248        40.00
       2.507     0.978125       342316        45.71
       2.743     0.981250       343396        53.33
       3.465     0.984375       344487        64.00
       3.899     0.985938       345034        71.11
       4.239     0.987500       345583        80.00
       4.539     0.989062       346133        91.43
       5.215     0.990625       346681       106.67
       6.079     0.992188       347224       128.00
       6.759     0.992969       347495       142.22
       7.387     0.993750       347768       160.00
       8.351     0.994531       348042       182.86
       9.367     0.995313       348315       213.33
      11.455     0.996094       348588       256.00
      12.967     0.996484       348726       284.44
      14.503     0.996875       348862       320.00
      15.911     0.997266       349000       365.71
      17.823     0.997656       349135       426.67
      19.711     0.998047       349272       512.00
      20.479     0.998242       349340       568.89
      20.991     0.998437       349409       640.00
      22.927     0.998633       349478       731.43
      24.831     0.998828       349545       853.33
      26.767     0.999023       349614      1024.00
      27.615     0.999121       349648      1137.78
      28.447     0.999219       349683      1280.00
      29.327     0.999316       349716      1462.86
      30.111     0.999414       349750      1706.67
      30.703     0.999512       349785      2048.00
      31.055     0.999561       349803      2275.56
      31.423     0.999609       349819      2560.00
      32.015     0.999658       349836      2925.71
      32.831     0.999707       349853      3413.33
      33.183     0.999756       349870      4096.00
      33.279     0.999780       349879      4551.11
      33.535     0.999805       349887      5120.00
      33.855     0.999829       349896      5851.43
      34.143     0.999854       349904      6826.67
      34.431     0.999878       349913      8192.00
      34.591     0.999890       349917      9102.22
      34.687     0.999902       349921     10240.00
      34.879     0.999915       349926     11702.86
      34.943     0.999927       349931     13653.33
      34.975     0.999939       349936     16384.00
      34.975     0.999945       349936     18204.44
      35.007     0.999951       349940     20480.00
      35.039     0.999957       349946     23405.71
      35.039     0.999963       349946     27306.67
      35.039     0.999969       349946     32768.00
      35.039     0.999973       349946     36408.89
      35.071     0.999976       349951     40960.00
      35.071     0.999979       349951     46811.43
      35.071     0.999982       349951     54613.33
      35.071     0.999985       349951     65536.00
      35.071     0.999986       349951     72817.78
      35.071     0.999988       349951     81920.00
      35.103     0.999989       349955     93622.86
      35.103     1.000000       349955          inf
#[Mean    =        1.087, StdDeviation   =        1.554]
#[Max     =       35.072, Total count    =       349955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  449998 requests in 45.00s, 28.75MB read
Requests/sec:   9999.77
Transfer/sec:    654.28KB