src/main/java/ok/dht/test/slastin/report/wrk2/puts-20000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.651ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   653.63us  610.16us   9.47ms   95.69%
    Req/Sec    21.11k     1.66k   32.50k    71.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  598.00us
 75.000%    0.88ms
 90.000%    1.04ms
 99.000%    3.23ms
 99.900%    7.47ms
 99.990%    9.37ms
 99.999%    9.47ms
100.000%    9.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.022     0.000000            1         1.00
       0.146     0.100000        70556         1.11
       0.260     0.200000       140563         1.25
       0.373     0.300000       210587         1.43
       0.486     0.400000       280464         1.67
       0.598     0.500000       350099         2.00
       0.654     0.550000       385084         2.22
       0.710     0.600000       420135         2.50
       0.766     0.650000       455339         2.86
       0.822     0.700000       490291         3.33
       0.878     0.750000       525468         4.00
       0.905     0.775000       542495         4.44
       0.933     0.800000       560091         5.00
       0.961     0.825000       577715         5.71
       0.989     0.850000       595374         6.67
       1.016     0.875000       612522         8.00
       1.030     0.887500       621453         8.89
       1.044     0.900000       630322        10.00
       1.058     0.912500       639230        11.43
       1.071     0.925000       647511        13.33
       1.085     0.937500       656440        16.00
       1.095     0.943750       660675        17.78
       1.115     0.950000       665008        20.00
       1.143     0.956250       669371        22.86
       1.195     0.962500       673697        26.67
       1.278     0.968750       678060        32.00
       1.344     0.971875       680259        35.56
       1.434     0.975000       682431        40.00
       1.558     0.978125       684634        45.71
       1.759     0.981250       686809        53.33
       2.159     0.984375       689000        64.00
       2.411     0.985938       690096        71.11
       2.637     0.987500       691185        80.00
       2.919     0.989062       692274        91.43
       3.457     0.990625       693366       106.67
       3.939     0.992188       694461       128.00
       4.175     0.992969       695008       142.22
       4.415     0.993750       695558       160.00
       4.767     0.994531       696110       182.86
       5.079     0.995313       696647       213.33
       5.399     0.996094       697198       256.00
       5.567     0.996484       697476       284.44
       5.763     0.996875       697745       320.00
       5.923     0.997266       698025       365.71
       6.255     0.997656       698287       426.67
       6.627     0.998047       698561       512.00
       6.855     0.998242       698697       568.89
       7.043     0.998437       698834       640.00
       7.279     0.998633       698972       731.43
       7.427     0.998828       699110       853.33
       7.475     0.999023       699246      1024.00
       7.511     0.999121       699312      1137.78
       7.647     0.999219       699382      1280.00
       7.835     0.999316       699451      1462.86
       8.047     0.999414       699523      1706.67
       8.063     0.999512       699603      2048.00
       8.071     0.999561       699633      2275.56
       8.255     0.999609       699655      2560.00
       8.639     0.999658       699688      2925.71
       8.807     0.999707       699722      3413.33
       9.015     0.999756       699757      4096.00
       9.087     0.999780       699777      4551.11
       9.175     0.999805       699791      5120.00
       9.255     0.999829       699810      5851.43
       9.295     0.999854       699826      6826.67
       9.351     0.999878       699847      8192.00
       9.359     0.999890       699852      9102.22
       9.375     0.999902       699861     10240.00
       9.383     0.999915       699868     11702.86
       9.415     0.999927       699876     13653.33
       9.439     0.999939       699894     16384.00
       9.439     0.999945       699894     18204.44
       9.439     0.999951       699894     20480.00
       9.447     0.999957       699901     23405.71
       9.455     0.999963       699905     27306.67
       9.463     0.999969       699911     32768.00
       9.463     0.999973       699911     36408.89
       9.463     0.999976       699911     40960.00
       9.471     0.999979       699925     46811.43
       9.471     0.999982       699925     54613.33
       9.471     0.999985       699925     65536.00
       9.471     0.999986       699925     72817.78
       9.471     0.999988       699925     81920.00
       9.471     0.999989       699925     93622.86
       9.471     0.999991       699925    109226.67
       9.471     0.999992       699925    131072.00
       9.471     0.999993       699925    145635.56
       9.471     0.999994       699925    163840.00
       9.471     0.999995       699925    187245.71
       9.471     0.999995       699925    218453.33
       9.471     0.999996       699925    262144.00
       9.471     0.999997       699925    291271.11
       9.471     0.999997       699925    327680.00
       9.479     0.999997       699927    374491.43
       9.479     1.000000       699927          inf
#[Mean    =        0.654, StdDeviation   =        0.610]
#[Max     =        9.472, Total count    =       699927]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899993 requests in 45.00s, 57.51MB read
Requests/sec:  19999.87
Transfer/sec:      1.28MB